Revit 2027 API
Face.GetEdgesAsCurveLoops Method
Returns a list of closed curve loops that correspond to the edge loops of the face. Curves in each curve loop correspond to individual edges.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> GetEdgesAsCurveLoops()
Public Function GetEdgesAsCurveLoops As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ GetEdgesAsCurveLoops()
member GetEdgesAsCurveLoops : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
A list of closed curve loops, that correspond edges of face.
Remarks
 Orientations of the curves and curve loops match the orientations of the face's edges and edge loops. The order of the CurveLoops should be considered as arbitrary.
See Also
Reference
Face Class
Autodesk.Revit.DB Namespace